jmeter/results/report-booking-b/statistics.json
{
  "Create Payment" : {
    "transaction" : "Create Payment",
    "sampleCount" : 196,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 436.4591836734694,
    "medianResTime" : 383.5,
    "minResTime" : 354.0,
    "maxResTime" : 1717.0,
    "pct1ResTime" : 544.6,
    "pct2ResTime" : 755.6999999999982,
    "pct3ResTime" : 1709.24,
    "throughput" : 0.6789924583337663,
    "receivedKBytesPerSec" : 0.8858729729823358,
    "sentKBytesPerSec" : 0.40381485070826534
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 978,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 541.0950920245411,
    "medianResTime" : 376.0,
    "minResTime" : 157.0,
    "maxResTime" : 2318.0,
    "pct1ResTime" : 1209.4,
    "pct2ResTime" : 1341.2999999999997,
    "pct3ResTime" : 1588.9400000000005,
    "throughput" : 3.2818902076852607,
    "receivedKBytesPerSec" : 20.295530694943604,
    "sentKBytesPerSec" : 1.7589358783502629
  },
  "Create Booking" : {
    "transaction" : "Create Booking",
    "sampleCount" : 197,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 250.75634517766514,
    "medianResTime" : 228.0,
    "minResTime" : 214.0,
    "maxResTime" : 1183.0,
    "pct1ResTime" : 251.60000000000005,
    "pct2ResTime" : 425.79999999999995,
    "pct3ResTime" : 806.6800000000039,
    "throughput" : 0.6746067077138024,
    "receivedKBytesPerSec" : 0.9190198801374554,
    "sentKBytesPerSec" : 0.49212032291231483
  },
  "View Bookings" : {
    "transaction" : "View Bookings",
    "sampleCount" : 192,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 282.0885416666667,
    "medianResTime" : 240.5,
    "minResTime" : 157.0,
    "maxResTime" : 860.0,
    "pct1ResTime" : 398.80000000000007,
    "pct2ResTime" : 459.19999999999993,
    "pct3ResTime" : 721.4299999999989,
    "throughput" : 0.6828609026567557,
    "receivedKBytesPerSec" : 17.55768863143294,
    "sentKBytesPerSec" : 0.3020859266635843
  },
  "Login Request" : {
    "transaction" : "Login Request",
    "sampleCount" : 199,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 524.462311557789,
    "medianResTime" : 546.0,
    "minResTime" : 329.0,
    "maxResTime" : 1347.0,
    "pct1ResTime" : 733.0,
    "pct2ResTime" : 805.0,
    "pct3ResTime" : 999.0,
    "throughput" : 0.6705055072424703,
    "receivedKBytesPerSec" : 1.1118343274391744,
    "sentKBytesPerSec" : 0.16631679574178462
  },
  "Process Payment" : {
    "transaction" : "Process Payment",
    "sampleCount" : 194,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1215.0360824742265,
    "medianResTime" : 1202.5,
    "minResTime" : 903.0,
    "maxResTime" : 2318.0,
    "pct1ResTime" : 1455.0,
    "pct2ResTime" : 1542.5,
    "pct3ResTime" : 1839.2000000000057,
    "throughput" : 0.6805083467505726,
    "receivedKBytesPerSec" : 0.9024710301633571,
    "sentKBytesPerSec" : 0.45455830974354655
  }
}