jmeter/results/report-cache-b+c/statistics.json
{
  "GET /hotels/locations?query=New" : {
    "transaction" : "GET /hotels/locations?query=New",
    "sampleCount" : 3212,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 275.6849315068481,
    "medianResTime" : 181.0,
    "minResTime" : 153.0,
    "maxResTime" : 1521.0,
    "pct1ResTime" : 474.0,
    "pct2ResTime" : 543.0,
    "pct3ResTime" : 803.3499999999995,
    "throughput" : 27.5025901411948,
    "receivedKBytesPerSec" : 59.329317990136055,
    "sentKBytesPerSec" : 4.40471170230073
  },
  "GET /flights/prices-by-date" : {
    "transaction" : "GET /flights/prices-by-date",
    "sampleCount" : 2122,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1017.4891611687077,
    "medianResTime" : 415.0,
    "minResTime" : 158.0,
    "maxResTime" : 11178.0,
    "pct1ResTime" : 2288.7000000000007,
    "pct2ResTime" : 5693.049999999999,
    "pct3ResTime" : 8921.869999999999,
    "throughput" : 18.03900232925855,
    "receivedKBytesPerSec" : 76.471981554015,
    "sentKBytesPerSec" : 3.100453525341313
  },
  "GET /cars/search - Los Angeles" : {
    "transaction" : "GET /cars/search - Los Angeles",
    "sampleCount" : 2745,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 92.20947176684885,
    "medianResTime" : 85.0,
    "minResTime" : 75.0,
    "maxResTime" : 478.0,
    "pct1ResTime" : 98.0,
    "pct2ResTime" : 116.69999999999982,
    "pct3ResTime" : 247.0,
    "throughput" : 23.24793563413085,
    "receivedKBytesPerSec" : 79.98288792875292,
    "sentKBytesPerSec" : 5.289813479250476
  },
  "Login - Get Auth Token" : {
    "transaction" : "Login - Get Auth Token",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 378.0,
    "medianResTime" : 378.0,
    "minResTime" : 378.0,
    "maxResTime" : 378.0,
    "pct1ResTime" : 378.0,
    "pct2ResTime" : 378.0,
    "pct3ResTime" : 378.0,
    "throughput" : 2.6455026455026456,
    "receivedKBytesPerSec" : 4.386780753968254,
    "sentKBytesPerSec" : 0.6045386904761905
  },
  "GET /flights/airlines" : {
    "transaction" : "GET /flights/airlines",
    "sampleCount" : 2193,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 128.71682626538976,
    "medianResTime" : 83.0,
    "minResTime" : 73.0,
    "maxResTime" : 1439.0,
    "pct1ResTime" : 275.0,
    "pct2ResTime" : 405.59999999999945,
    "pct3ResTime" : 575.06,
    "throughput" : 18.596092531035886,
    "receivedKBytesPerSec" : 21.846776674644698,
    "sentKBytesPerSec" : 2.796677978300319
  },
  "GET /hotels/search - San Francisco" : {
    "transaction" : "GET /hotels/search - San Francisco",
    "sampleCount" : 3262,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 249.24095646842468,
    "medianResTime" : 168.0,
    "minResTime" : 80.0,
    "maxResTime" : 3420.0,
    "pct1ResTime" : 494.7000000000003,
    "pct2ResTime" : 627.8499999999999,
    "pct3ResTime" : 993.5899999999992,
    "throughput" : 27.55090836915852,
    "receivedKBytesPerSec" : 196.48855841793429,
    "sentKBytesPerSec" : 6.161287125524709
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 20594,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 241.8117412838687,
    "medianResTime" : 92.0,
    "minResTime" : 0.0,
    "maxResTime" : 11178.0,
    "pct1ResTime" : 446.0,
    "pct2ResTime" : 617.9500000000007,
    "pct3ResTime" : 2696.880000000019,
    "throughput" : 56.838316874858556,
    "receivedKBytesPerSec" : 175.79620599353206,
    "sentKBytesPerSec" : 10.4110856831969
  },
  "GET /flights/locations?query=San" : {
    "transaction" : "GET /flights/locations?query=San",
    "sampleCount" : 2161,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.5543729754743163,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 121.0,
    "pct1ResTime" : 8.0,
    "pct2ResTime" : 12.0,
    "pct3ResTime" : 21.38000000000011,
    "throughput" : 18.49585319718925,
    "receivedKBytesPerSec" : 17.79142128831192,
    "sentKBytesPerSec" : 2.9802888452502203
  },
  "GET /flights/search - LAX to SFO" : {
    "transaction" : "GET /flights/search - LAX to SFO",
    "sampleCount" : 2198,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 151.12966333030016,
    "medianResTime" : 84.0,
    "minResTime" : 75.0,
    "maxResTime" : 1898.0,
    "pct1ResTime" : 347.0,
    "pct2ResTime" : 463.0499999999997,
    "pct3ResTime" : 1042.129999999997,
    "throughput" : 18.520390967307044,
    "receivedKBytesPerSec" : 62.97656381656555,
    "sentKBytesPerSec" : 3.6534364994101782
  },
  "GET /cars/locations?query=Los" : {
    "transaction" : "GET /cars/locations?query=Los",
    "sampleCount" : 2700,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 91.33407407407414,
    "medianResTime" : 84.0,
    "minResTime" : 75.0,
    "maxResTime" : 486.0,
    "pct1ResTime" : 97.0,
    "pct2ResTime" : 120.94999999999982,
    "pct3ResTime" : 252.98999999999978,
    "throughput" : 23.30780984280177,
    "receivedKBytesPerSec" : 25.31082475116755,
    "sentKBytesPerSec" : 3.687368354036999
  }
}